Repository: UAlbertaALTLab/oahpa
Catalog: kursadict/translations/*/LC_MESSAGES/messages.po
Languages: fi, sv

source: North Sámi
fi: pohjoissaame
sv: Nordsamiska

source: North Sámi (#SoMe)
fi: pohjoissaame (#SoMe)

source: Finnish
fi: suomi
sv: Finska

source: Norwegian
fi: norja
sv: Norska

source: South Sámi
fi: eteläsaame
sv: Sydsamisk

source: is a possible form of ...
fi: on mahdollinen muoto sanasta ...
sv: är en möjlig form av ...

source: Invalid format. Only json and html allowed.
fi: Kelvoton muoto. Hyväksytään vain json ja html
sv: Ogiltigt format. Bara json och html tillåtit

source: Whoops! The page you requested was not found. If you think you are receiving this in error, please contact us.
fi: Oho! Etsimääsi sivua ei löytynyt. Jos olet sitä mieltä, että sivun olisi pitänyt löytyä, ota yhteyttä meihin.
sv: Oj då! Sidan du frågade efter kunde inte hittas. Om du tycker du inte borde få det här felmeddelandet, så var god kontakta oss.

source: About
fi: Meistä
sv: Om oss

source: A dictionary that understands what you're looking for.
fi: Sanakirja, joka ymmärtää, mitä etsit.
sv: En ordbok som förstår vad du letar efter.

source: (... And is mobile-friendly!)
fi: (... Ja on kännykkä-ystävällinen!)

source: Free
fi: Ilmainen
sv: Gratis

source: Everything (or, well, almost everything) that concerns minority languages should be free. Here you'll find free dictionaries, and other analytical tools.
fi: Kaiken (tai ainakin melkein kaiken), mikä koskee vähemmistökieliä, pitäisi olla ilmaista. Tästä löydät vapaat ja ilmaiset sanakirjat, ja muita analyysityökaluja.
sv: Allt (eller nästan allt, i varje fall) som gäller minoritetsspråk borda vara gratis. Här hittar du gratis och fria ordböcker och andra analysverktyg.

source: Open-Source
fi: Avoin lähdekoodi
sv: Öppen källkod

source: Everything here is based on open-source tools. Do you have an idea for an app or research project that needs linguistic resources? Visit <a class="blue" href="http://giellatekno.uit.no/">Giellatekno</a>'s website for information on how to get access to lexicon files, and morphological and syntactic analyzers.
fi: Kaikki tässä perustuu avoimeen lähdekoodiin. Jos suunnittelet appin tekemistä tai tutkimusprojektia, mihin tarvitset lingvistisiä resursseja, niin <a class="blue" href="http://giellatekno.uit.no/">Giellatekno</a> kotisivulta löydät tietoja sanalistojen ja morfologisten ja syntaktisten analysaattorien käytöstä.
sv: Allt här är baserad på öppen källkod. Har du en idé till en app eller forskningsprojekt som behöver språkliga resurser? Se <a class="blue" href="http://giellatekno.uit.no/">Giellateknos</a> webbplats för information om hur du får tillgång till lexiconfiler och morfologiska och syntaktiska analysatorer.

source: Linguistic basis
fi: Lingvistinen perusta
sv: Lingvistisk grund

source: Write what you wish, and the dictionary will analyze it to break apart compound words and find base forms.
fi: Kirjoita haluamasi sana, ja sanakirja analysoi sitä ja jakaa mahdolliset yhdyssanat osiinsa.
sv: Skriv vilked ord du vill, och ordboken kommer att analysera den, ta isär sammansatta ord och hitta basformer.

source: gå, dra, reise
fi: mennä, lähteä

source: Source material
fi: Lähdemateriaalia

source: sme ↔ nob
fi: Pohjoissaame ↔ norja

source: North Sámi → Norwegian builds on Nils Jernsletten's dictionary <em>Álgosátnegirji</em>, but here it has been more than doubled in content.
fi: Pohjoissaame → norja perustuu Nils Jernslettenin sanakirjaan <em>Álgosátnegirji</em>, mutta sisältä on kaksinkertaistettu.

source: Norwegian → North Sámi is a converted version of North Sámi → Norwegian, but we have also revised the content and added frequent words from Norwegian.
fi: Norja → pohjoissaame on käännetty versio Pohjoissaame → norja -sanakirjasta, mutta me olemme myös lisännet tavallisia norjalaisia sanoja. Sanakirja tunnistaa myös tavallisimmat nykynorjan sanat ja taivutusmuodot.

source: sma ↔ nob
fi: Eteläsaame ↔ norja

source: The dictionaries for South Sámi and Norwegian build on material prepared by Albert Jåma and Tove Brustad in the <a class="blue" href="http://www.ruovatsijte.no/">Hemnes Sámi Organization</a>, but has in addition gained words from <a class="blue" href="http://giellatekno.uit.no/">Giellatekno</a> and <a class="blue" href="http://aajege.no/">Aajege</a>'s work with the Southern Sámi <a class="blue" href="http://oahpa.no">Oahpa</a>.
fi: Eteläsaame - norja -sanakirjat perustuvat Albert Jåman ja Tove Brustadin materiaaliin (ks. <a class="blue" href="http://www.ruovatsijte.no/">Hemnes Samiske Forening</a>) sen lisäksi on lisätty sanoja <a class="blue" href="http://giellatekno.uit.no/">Giellateknon</a> ja <a class="blue" href="http://aajege.no/">Aajegen</a> työstä eteläsaamen <a class="blue" href="http://oahpa.no">Oahpan</a> parissa.

source: sme ↔ fin
fi: Pohjoissaame ↔ suomi

source: Dictionaries for North Sámi and Finnish are based on lexical material from the <a class="green" href="http://kotus.fi">Institute for the Languages of Finland</a>, and from Giellatekno's work with the North Sámi <a class="green" href="http://oahpa.no">Oahpa</a>. In addition, we have included frequent words from North Sámi, but especially from Finnish.
fi: Pohjoissaame-norja-pohjoissaame-sanakirjat perustuvat <a class="green" href="http://kotus.fi">Kotimaisten kielten tutkimuskeskuksen</a> <a class="green" href="kaino.kotus.fi/algu/">Álgu</a>-projektin sanastoihin ja Giellateknon työhön pohjoissaamen <a class="green" href="http://oahpa.no">Oahpan</a> parissa. Sen lisäksi olemme lisännet tavallisia suomenkielisiä sanoja.

source: Each of the dictionaries contains about 11,000 base words.
fi: Jokainen sanakirja sisältaa n. 11000 hakusanaa.

source: More to come...
fi: Lisää tulossa...

source: Home
fi: Koti
sv: Hem

source: Plugins
fi: Laajennuksia

source: Created with free and open-source language tools from <em><a href="http://giellatekno.uit.no">Giellatekno</a></em>, a Sámi Language Technology group at the <a href="http://uit.no">University of Tromsø</a>.
fi: Luotu <em><a href="http://giellatekno.uit.no/index.fin.html">Giellateknon</a></em> vapaan ja avoimen lähdekoodin avulla. Giellatekno on <a href="http://uit.no">Tromssan yliopiston</a> kieliteknologian tutkimusryhmä.
sv: Skapad med språkverktyg grundat på fri och öppen källkod från <em><a href="http://giellatekno.uit.no">Giellatekno</a></em>, Senter for samisk språkteknologi vid <a href="http://uit.no">Universitetet i Tromsö</a>.

source: Written variant
fi: Kirjakielen versio

source: Standard (<em>áčđŋšŧž</em>)
fi: Standardi (<em>áčđŋšŧž</em>)

source: Social Media (incl. <em>acdnstz</em>)
fi: Sosiaalimedia (myös <em>acdnstz</em>)

source: Swap
fi: Vaihda

source: Search
fi: Etsi
sv: Sök

source: Definition not found for:
fi: Käännös ei löydetty sanalle tai sanoille

source: Word %(input)s not found.
fi: Sanaa %(input%) ei löytynyt.
sv: Ord %(input) hittades inte.

source: Search for a word, or a word form for a word analysis and definition.
fi: Etsi sanaa tai sanamuotoa analyysia ja käännöstä varten.
sv: Sök efter ett ord eller en ordform för en ordanalys och definition.

source: You selected #SoMe, the variant for social media, which means that the letters acdnstz will be accepted as áčđŋšŧž in addition to their usual values.
fi: Valitsit #SoMe, eli sosiaalisen median versio. Se tarkoittaa, ettö kirjaimet acdnstz hyväksytään kirjainten áčđŋšŧž versioina, tavallisen tulkintansa lisäksi.

source: Language
fi: Kieli
sv: Språk

source: Neahttadigisánit Reader
fi: Neahttadigisánit Lukija
sv: Neahttadigisánit Läsordbok

source: Bookmarklet
fi: Kirjanmerkki
sv: Bokmärke

source: Drag and drop the following link to your Bookmark toolbar, then click it when you are on a page you wish to read. The service will automatically be installed, and you will see a menu icon on the left-hand side of the page.
fi: Raahaa alla oleva punainen linkki Kirjanmerkki-valikkoosi. Kun olet nettisivulla, jota haluat lukea, klikkaat kirjanmerkkiä. Lukusanakirja asennetaan automaattisesti, ja näet valikkosymbolin <em>Á</em> sivun vasemassa reunassa.
sv: Dra och släpp fäljande länk till din bokmärkelinje, klicka på den när du är på en sida som du vill läsa. Tjänsten installeras automatiskt, och du kommer at se en meny-ikon längst til vänster på sidan.

source: Read with Neahttadigisánit
fi: Lue Neahttadigisánit-sanakirjan avulla
sv: Läs med Neahttadigisánit

source: In order to look up a word, hold Alt or Option (⌥) and double click the word. The service will will connect to this website and return dictionary entries after a brief pause.
fi: Etsiäksesi sanaa, paina <em>Alt</em> tai <em>Option</em> (⌥) ja kaksoisklikkaa sanaa. Palvelu ottaa yhteyttä tähän nettisivuun ja antaa sinulle käännöksen lyhyen tauon jälkeen.
sv: För att slå upp ett ord håller du dere <em>Alt</em> eller <em>Option</em> (⌥) och duppeltklickar på ordet. Tjänsten ansluter till sidan och returnerar inom kort med et uppslag ur ordboken.

source: To change the dictionary, click the menu icon.
fi: Vaihdakseesi sanakirja, klikkaa ikoni

source: Bugs?
fi: Virheitä?
sv: Fel?

source: If you encounter bugs, or the bookmarklet does not work on a particular page, contact us with the page URL or details of what you were reading when you encountered the problem.
fi: Jos löydät virheitä, tai jos kirjanmerkki ei toimii tietyllä nettisivulla, voit ottaa yhteyttä meihin, ja kertoa sivun URL ja mitä olit lukemassa kun sanakirja ei toiminut.
sv: Om du påträffar fel eller bokmärket inte fungerar på en viss sida, kontakta oss med webbadress eller berätta vad du läste när du stötte på problem.

source: We do not store any private data, but we do collect individual dictionary lookups for statistics and to improve the dictionary.
fi: Me emme tallenna yksityisiä tietoja, mutta keräamme yksittäisiä sanahakuja tilastoa ja sanakirjan parantamista varten.
sv: Vi sparar inte några privata data, men vi samlar individuella ordboksuppslagningar fär statistik, och för att förbättra ordboken.

source: is a possible form of ...
fi: on mahdollinen muoto sanasta ...
sv: er en mäjlig form av ...

source: More information about this word
fi: Lisätietoa tästä sanasta
sv: Mer inmormation om detta ord
